# Taps
tap 'homebrew/bundle'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
# cask '1password' We'll install it manually first to setup the SSH agent to sync the SSH keys
cask 'arctic'
cask 'appdelete'
cask 'deepl'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'herd'
cask 'iterm2'
cask 'invoker'
cask 'logi-options-plus'
cask 'microsoft-teams'
cask 'notion'
cask 'phpstorm'
cask 'raycast'
cask 'setapp'
cask 'sourcetree'
cask 'sublime-text'
cask 'tinkerwell'
cask 'wifiman'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Install Mac App Store apps
# use command: "mas list" to get a list of currenty installed apps
mas 'Final Cut Pro', id: 424389933
mas 'Keynote', id: 409183694
mas 'LanScan', id: 472226235
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Leaf', id: 576338668
mas 'Pages', id: 409201541
mas 'Compressor', id: 424390742
mas 'Mactracker', id: 430255202
mas 'Evernote', id: 406056744
mas 'Kaleidoscope', id: 587512244
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Outlook', id: 985367838
mas 'Microsoft PowerPoint', id: 462062816
mas 'LanguageTool', id: 1534275760
mas 'Telegram', id: 747648890
mas 'Brother P-touch Editor', id: 1453365242
mas '1Password for Safari', id: 1569813296
mas 'Todoist', id: 585829637
mas 'Amphetamine', id: 937984704
