# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask 'adguard'
cask 'adobe-creative-cloud'
cask 'appdelete'
cask 'dbngin'
cask 'deepl'
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'helo'
cask 'iterm2'
cask 'invoker'
cask 'microsoft-teams'
cask 'phpstorm'
cask 'phpmon'
cask 'ray'
cask 'raycast'
cask 'setapp'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'tinkerwell'
cask 'toggl-track'
cask 'transmit'
cask 'whatsapp'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
# use command: "mas list" to get a list of currenty installed apps
mas 'Final Cut Pro', id: 424389933
mas 'Keynote', id: 409183694
mas 'LanScan', id: 472226235
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Leaf', id: 576338668
mas 'Pages', id: 409201541
mas 'Bear', id: 1091189122
mas 'Compressor', id: 424390742
mas 'Mactracker', id: 430255202
mas 'Evernote', id: 406056744
mas 'Kaleidoscope', id: 587512244
mas 'Medis', id: 1063631769
mas 'Giphy Capture', id: 668208984
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Outlook', id: 985367838
mas 'Microsoft PowerPoint', id: 462062816
mas 'Things', id: 904280696
mas 'Spark', id: 1176895641
mas 'LanguageTool', id: 1534275760
mas 'Telegram', id: 747648890
mas 'Brother P-touch Editor', id: 1453365242
mas '1Password for Safari', id: 1569813296